MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EZR32HG320F32R61/mcu.h
// #include "ezr32hg_prs_signals.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_dmareq.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_dmactrl.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_usartrf.h"  // Note: Changed for MikroE implementation.

/***************************************************************************//**
 * @defgroup EZR32HG320F32R61_UNLOCK EZR32HG320F32R61 Unlock Codes
 * @{
 ******************************************************************************/
#define MSC_UNLOCK_CODE      0x1B71 /**< MSC unlock code */
#define EMU_UNLOCK_CODE      0xADE8 /**< EMU unlock code */
#define CMU_UNLOCK_CODE      0x580E /**< CMU unlock code */
#define TIMER_UNLOCK_CODE    0xCE80 /**< TIMER unlock code */
#define GPIO_UNLOCK_CODE     0xA534 /**< GPIO unlock code */

/** @} End of group EZR32HG320F32R61_UNLOCK */

/** @} End of group EZR32HG320F32R61_BitFields */

/***************************************************************************//**
 * @defgroup EZR32HG320F32R61_Alternate_Function EZR32HG320F32R61 Alternate Function
 * @{
 ******************************************************************************/

// #include "ezr32hg_af_ports.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_af_pins.h"  // Note: Changed for MikroE implementation.

/** @} End of group EZR32HG320F32R61_Alternate_Function */

/***************************************************************************//**
 *  @brief Set the value of a bit field within a register.
 *
 *  @param REG
 *       The register to up2026-04-27
 *  @param MASK
 *       The mask for the bit field to up2026-04-27
 *  @param VALUE
 *       The value to write to the bit field
 *  @param OFFSET
 *       The number of bits that the field is offset within the register.
 *       0 (zero) means LSB.
 ******************************************************************************/
#define SET_BIT_FIELD(REG, MASK, VALUE, OFFSET) \
  REG = ((REG) &~(MASK)) | (((VALUE) << (OFFSET)) & (MASK));

/** @} End of group EZR32HG320F32R61 */

/** @} End of group Parts */

#ifdef __cplusplus
}
#endif

#endif /* EZR32HG320F32R61_H */
